# ******************************************************************************************************
# FileName     : SmartAqua_Basic
# Description  : 스마트 아쿠아 코딩 키트 (기본)
# Author       : 손철수
# CopyRight    : (주)한국공학기술연구원(www.ketri.re.kr)
# Created Date : 2023.12.13
# Reference    :
# Modified     : 
# ******************************************************************************************************

# import
import time                                        # 시간 관련 모듈
from machine import Pin, time_pulse_us             # 핀 및 시간 관련 모듈
from ETboard.lib.pin_define import *               # ETboard 핀 관련 모듈
from ETboard.lib.OLED_U8G2 import *                # ETboard OLED 관련 모듈
import onewire, ds18x20                            # 수중온도 센서 관련 모듈


#-------------------------------------------------------------------------------------------------------
# ETBoard 핀번호 설정
#-------------------------------------------------------------------------------------------------------
# global variable
oled = oled_u8g2()                                 

heater_pin = Pin(D2, Pin.OUT)                      # D2를 LED 출력모드 설정
ds_pin = Pin(D6)
ds_sensor = ds18x20.DS18X20(onewire.OneWire(ds_pin))

roms = 0


#=======================================================================================================
# setup
#=======================================================================================================
def setup():
    global ds_sensor, roms
    roms = ds_sensor.scan()
    print('Found DS devices: ', roms)


#=======================================================================================================
# main loop
#=======================================================================================================
def loop():
    #---------------------------------------------------------------------------------------------------
    # 
    #---------------------------------------------------------------------------------------------------
    global ds_sensor
    
    ds_sensor.convert_temp()
    time.sleep_ms(750)
    temp = 0;
    for rom in roms:    
        temp = ds_sensor.read_temp(rom);
    print(temp)        
        
    #--------------------------------------------------------------------------------------
    # OLED 텍스트 표시
    #--------------------------------------------------------------------------------------
    text1 = "Temp: %d" %(temp) + "C"         
    text2 = "TDS: %d" %(3) + "ppm"

    oled.clear()
    oled.setLine(1, "* Aqua *")                  # OLED 첫 번째 줄 : 시스템 이름
    oled.setLine(2, text1)                       # OLED 두 번째 줄 : 
    oled.setLine(3, text2)                       # OLED 세 번째 줄 : 
    oled.display()
    
  
    if (temp < 28):
       heater_pin.value(HIGH)                    # LED 켜기
    else:
       heater_pin.value(LOW)                     # LED 끄기
    
    time.sleep(0.3)                                


if __name__ == "__main__":
    setup()
    while True:
        loop()

#=======================================================================================================
#
#  (주)한국공학기술연구원 http://et.ketri.re.kr
#
#======================================================================================================= 
  