/******************************************************************************************************
 * FileName     : SmartAuqa_Basic
 * Description  : 스마트 아쿠아 코딩 키트 (기본)
 * Author       : 손철수
 * CopyRight    : (주)한국공학기술연구원(www.ketri.re.kr)
 * Warning      : Arduino IDE에서 u8g2 라이브러리를 추가해서 컴파일 해야함
 * Created Date : 2023.12.13 : SCS : 최초 작성
 * Modified     : 
 * Reference    : https://randomnerdtutorials.com/esp32-ds18b20-temperature-arduino-ide/
 ******************************************************************************************************/

// OLED 제어를 위한 라이브러리 불러오기
#include "oled_u8g2.h"
OLED_U8G2 oled;

#include <OneWire.h>
#include <DallasTemperature.h>
OneWire oneWire(D6);                            // DS18B20 통신 핀
DallasTemperature sensors(&oneWire);

//-------------------------------------------------------------------------------------------------------
// ETBoard 핀번호 설정
//-------------------------------------------------------------------------------------------------------
#include "pins_arduino.h"                       // support arduino uno with ET-Upboard

int heater_pin = D2;                            // D2를 히터 핀으로 설정
int air_pin = D3;                               // D3를 기포기 핀으로 설정
int air_button = D7;                            // 기포기 버튼 (D7 = 파랑 버튼)

//=======================================================================================================
void setup()
//=======================================================================================================
{
    Serial.begin(115200);                       // 시리얼 통신 준비
    oled.setup();                               // OLED 셋업

    pinMode(heater_pin, OUTPUT);                // 히터 핀을 출력 모드로 설정   
    pinMode(air_pin, OUTPUT);                   // 기포기 핀을 출력 모드로 설정   
    pinMode(air_button, INPUT);                 // 기포기 핀을 입력 모드로 설정
    sensors.begin();                            // DS18B20 sensor
}


//=======================================================================================================
void loop()
//=======================================================================================================
{
    //---------------------------------------------------------------------------------------------------
    // 기포기
    //---------------------------------------------------------------------------------------------------
    int air_button_status = digitalRead(air_button); 
    if (air_button_status == LOW) {        
        digitalWrite(air_pin, !digitalRead(air_pin));
        delay(100);
    }

    //---------------------------------------------------------------------------------------------------
    // 온도 센서
    //---------------------------------------------------------------------------------------------------
    sensors.requestTemperatures(); 
    float temperatureC = sensors.getTempCByIndex(0);

    //
    if (temperatureC < 26.0) {
        digitalWrite(heater_pin, HIGH);       
    }
    else {
        digitalWrite(heater_pin, LOW);         
    }

    //---------------------------------------------------------------------------------------------------
    // OLED 텍스트 표시
    //---------------------------------------------------------------------------------------------------
    char text1[32] = "count : ";                // text1 count 값 표시
    char value1[32];
    String str1 = String(temperatureC, DEC);
    str1.toCharArray(value1, 6);
    strcat(text1, value1);
  
    oled.setLine(1, "*Smart Aqua*");            // OLED 첫 번째 줄 : 시스템 이름
    oled.setLine(2, text1);                     // OLED 두 번째 줄 : 
    oled.setLine(3, "---------------------");   // OLED 세 번째 줄 
    oled.display();
    
    delay(500);  
}

//=======================================================================================================
//
// (주)한국공학기술연구원 http://et.ketri.re.kr
//
//=======================================================================================================
